{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"itemInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"itemInput"},"inbound_nodes":[]},{"name":"userInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"userInput"},"inbound_nodes":[]},{"name":"itemEmbedding","class_name":"Embedding","config":{"input_dim":1683,"output_dim":16,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"uniform","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"itemEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["itemInput",0,0,{}]]]},{"name":"userEmbedding","class_name":"Embedding","config":{"input_dim":944,"output_dim":16,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"uniform","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"userEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["userInput",0,0,{}]]]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":0,"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["itemEmbedding",0,0,{}],["userEmbedding",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dot_Dot1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]}],"input_layers":[["itemInput",0,0],["userInput",0,0]],"output_layers":[["dense_Dense1",0,0]]},"keras_version":"tfjs-layers 3.6.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"itemEmbedding/embeddings","shape":[1683,16],"dtype":"float32"},{"name":"userEmbedding/embeddings","shape":[944,16],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[256,1],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.6.0","convertedBy":null}